app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients` WHERE `clients`.`active` = 1
---
  def index
     render json: Client.where(active:true)

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 4 LIMIT 1
INSERT INTO `clients` (`id`, `nombre`, `apellido_p`, `apellido_m`, `RFC`, `active`, `created_at`, `updated_at`) VALUES (0, 'Angel', 'Vea', 'Heredia', '!123sd', 1, '2017-07-06 15:04:28', '2017-07-06 15:04:28')
UPDATE `clients` SET `nombre` = 'Bueno', `apellido_p` = 'Editar', `apellido_m` = 'El', `RFC` = '5', `updated_at` = '2017-07-06 04:39:22' WHERE `clients`.`id` = 5
---
  def create
    @id = client_params[:id].to_i
    @message = ''

      if @id.nil? || @id == 0
          @client = Client.new(client_params)
      else
        @client = Client.find_by_id(@id)
      end

      if @client.valid?
        if @client.id == 0 || @client.id.nil?
          @client.save()

SELECT `clients`.* FROM `clients` WHERE (nombre LIKE '%vea%' OR apellido_p LIKE '%vea%' OR apellido_m LIKE '%vea%')
---
 def search_client_name
    search = params[:s]
    render json: Client.where("nombre LIKE ? OR apellido_p LIKE ? OR apellido_m LIKE ?" , "%#{search}%","%#{search}%","%#{search}%")

SELECT  `clients`.* FROM `clients`  ORDER BY `clients`.`id` DESC LIMIT 1
---
 def lastclient
  render json: Client.last

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
def edit_client
  render json: Client.find(params[:client_id])