app/controllers/items_controller.rb

  def index
   render json: Item.where(active:true)
---
SELECT `items`.* FROM `items` WHERE `items`.`active` = 1

  def create
   @id = item_params[:id]
    @message = ''

      if @id.nil? || @id == 0
          @item = Item.new(item_params)
      else
        @item = Item.find_by_id(@id)
      end

      if @item.valid?
        if @item.id == 0 || @item.id.nil?
          @item.save()
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
INSERT INTO `items` (`id`, `descripcion`, `modelo`, `precio`, `existencia`, `active`, `created_at`, `updated_at`) VALUES (0, 'Mesa', 'Chocolate', 120.4, -12, 1, '2017-07-08 16:14:51', '2017-07-08 16:14:51')
UPDATE `items` SET `descripcion` = '23', `updated_at` = '2017-07-06 15:01:18' WHERE `items`.`id` = 27

   def search_item_name
    search = params[:s]
    render json: Item.where("descripcion LIKE ? OR modelo LIKE ?" , "%#{search}%","%#{search}%")
---
SELECT `items`.* FROM `items` WHERE (descripcion LIKE '%rom%' OR modelo LIKE '%rom%')

   def lastitem
  render json: Item.last
---
SELECT  `items`.* FROM `items`  ORDER BY `items`.`id` DESC LIMIT 1

def edit_item
  render json: Item.find(params[:item_id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1