app/controllers/modulos_controller.rb

SELECT `modulos`.* FROM `modulos`
SELECT `screens`.* FROM `screens` WHERE `screens`.`modulo_id` = 1
---
	  def modulos
        render json: Modulo.all.to_json(include: :screens)