app/controllers/sales_controller.rb

  def index
    all=Sale.where(active:true)
---
SELECT `sales`.* FROM `sales` WHERE `sales`.`active` = 1

  def create

    @sale = Sale.new(sale_params)
    @message=''

      if @sale.save
        articulos= params[:sale][:articulos_vendidos]

        articulos.each do |articulo|
          inventario= Item.find(articulo[:id_item])
          inventario.existencia = inventario.existencia - articulo[:item_cantidad]
          inventario.save()
          end



         articulos.each do |articulo|
          sold = ItemsSold.new(items_solds_params)
          ultima_venta= Sale.last
          sold.id_item=articulo[:id_item]
          sold.id_sale=ultima_venta.id
          sold.cantidad=articulo[:item_cantidad]
          sold.save()
---
INSERT INTO `sales` (`id_client`, `id_financing_models`, `id_financing_types`, `id_paid_systems`, `cantidad_pagos`, `fecha_venta`, `estatus`, `total_venta`, `pago_diferido`, `active`, `created_at`, `updated_at`) VALUES (13, 2, 1, 2, 12, '2017-07-08', 'Activa', 3.0053281, 0.21755039, 1, '2017-07-08 06:29:40', '2017-07-08 06:29:40')
SELECT  `sales`.* FROM `sales`  ORDER BY `sales`.`id` DESC LIMIT 1
SELECT  `items`.* FROM `items` WHERE `items`.`id` = NULL LIMIT 1
UPDATE `items` SET `existencia` = -2, `updated_at` = '2017-07-08 07:15:30' WHERE `items`.`id` = 27
INSERT INTO `items_solds` (`id_item`, `id_sale`, `cantidad`, `created_at`, `updated_at`) VALUES (1, 4, 1, '2017-07-12 03:37:08', '2017-07-12 03:37:08')

  def lastsale
  render json: Sale.last
---
SELECT  `sales`.* FROM `sales`  ORDER BY `sales`.`id` DESC LIMIT 1

    def set_sale
      @sale = Sale.find(params[:id])
---
SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1