app/controllers/settings_controller.rb

  def index
    render json: Setting.last
---
SELECT  `settings`.* FROM `settings`  ORDER BY `settings`.`id` DESC LIMIT 1

  def create
      @first =Setting.last
      @message = ''

      if @first.nil?
          @setting = Setting.new(setting_params)
      else
        @setting = @first
      end

      if @setting.valid?
        if @first.nil?
          @setting.save()
---
SELECT  `settings`.* FROM `settings`  ORDER BY `settings`.`id` DESC LIMIT 1
INSERT INTO `settings` (`tasa_financiamiento`, `porcentaje_enganche`, `plazo_maximo`, `active`, `created_at`, `updated_at`) VALUES (1, 2, '2017-07-31', 1, '2017-07-06 17:51:40', '2017-07-06 17:51:40')